import type { ExperienceItem } from './types';

export const experiences: ExperienceItem[] = [
	{
		period: '2025.3 - 2026.4',
		company: '广州冠晨网络有限公司',
		responsibilities: [
			'参与公司海外金融借款app马甲包的开发, 主要负责墨西哥国家业务线',
			'移动端App: 负责不同端化情况的H5借款/还款/申贷/分期页面与安卓原生的交互',
			'业务后台: 负责app包体后台管理系统的功能迭代',
			'催收后台: 负责墨象催收后台管理系统的功能迭代',
			'静态官网: 负责各包体的PC端官网的开发',
			'针对App的H5流程, 开发AI自动化工具, 开发新功能之后, 可自动跑主流程',
			'为方便日常开发快速寻找包体/包名/App名称, 开发 Raycast 插件, 可快速找到',
		],
	},
	{
		period: '2020.11 - 2025.1',
		company: '广州闪趣网络科技有限公司',
		responsibilities: [
			'参与公司自营App-指趣游戏盒的所有Web业务线开发',
			'参与开发指趣游戏盒、指趣SDK的H5活动页面，与安卓、iOS原生交互',
			'参与移动端iOS-H5版本的指趣游戏盒的开发，主要在Safari浏览器中运行',
			'参与公司内部所有后台管理系统的开发和维护',
			'负责所有前端项目的开发工具、构建工具的升级和迭代：例如老旧 vue-cli 项目升级到 vite；以及自动化部署：例如打包自动上传到阿里云、与运维对接并集成gitlab-cicd',
		],
	},
	{
		period: '2019.11 - 2020.6',
		company: '3K游戏',
		responsibilities: [
			'负责独立 & 海外游戏的业务线开发(包括移动端预约下载抽奖等 H5 页面)',
			'参与平台活动业务线开发(微信平台的引流 & 活动 H5 页面)',
			'参与内部数据平台系统的研发(利用 Vue 进行诸如 DatePicker 等组件的开发)',
			'参与团队内部的技术文档的构建(主要是前端方向的知识总结, 以及项目中遇到的难点)',
		],
	},
];
